# 🤖 SGR Agent Visualizer

Интерактивный Streamlit интерфейс для визуализации трейсинга агентов на основе Schema-Guided Reasoning (SGR).

## 📋 Описание

Agent Visualizer позволяет визуализировать работу SGR агента в виде интерактивного роудмапа, показывая:

- 🗺️ **Роудмап выполнения** - последовательность шагов и фаз работы агента
- 🧠 **Reasoning процесс** - рассуждения агента на каждом шаге
- 🛠️ **Вызовы инструментов** - какие инструменты использовались и когда
- 📊 **Метрики производительности** - время выполнения, использование токенов
- ⏳ **Временная линия** - хронология событий выполнения
- 🔍 **Результаты поиска** - данные, полученные агентом

## 🚀 Быстрый старт

### 1. Установка зависимостей

```bash
# Создаем виртуальное окружение (рекомендуется)
python -m venv venv
source venv/bin/activate  # На Windows: venv\Scripts\activate

# Устанавливаем зависимости
pip install -r requirements.txt
```

### 2. Запуск приложения

```bash
# Из директории agent_visualizer
streamlit run app.py

# Или с указанием порта
streamlit run app.py --server.port 8501
```

### 3. Использование

После запуска приложение откроется в браузере по адресу `http://localhost:8501`

**Два способа загрузки логов:**

#### Способ 1: Из директории с логами
1. Выберите "Выбрать из директории"
2. Укажите путь к директории с логами (по умолчанию `logs`)
3. Выберите нужный файл из выпадающего списка

#### Способ 2: Загрузка файла
1. Выберите "Загрузить файл"
2. Нажмите "Browse files" и выберите JSON файл с логами

## 📁 Структура проекта

```
agent_visualizer/
│
├── app.py                  # Главное приложение Streamlit
├── log_parser.py          # Парсер JSON логов
├── visualizers.py         # Компоненты визуализации
├── requirements.txt       # Зависимости Python
├── __init__.py           # Инициализация пакета
└── README.md             # Документация
```

## 📊 Возможности визуализации

### 🗺️ Роудмап выполнения

Интерактивная диаграмма, показывающая:
- Последовательность шагов агента
- Типы операций (LLM вызовы, reasoning, выполнение инструментов)
- Длительность каждого шага
- Фазы выполнения

### 📈 Метрики производительности

Детальная аналитика:
- **Длительность выполнения** - график времени на каждый шаг
- **Использование токенов** - prompt и completion токены
- **Накопительная динамика** - рост токенов и времени
- **Общая статистика** - суммарные метрики

### ⏳ Временная линия

Хронологическое представление:
- Временные метки всех событий
- Продолжительность операций
- Параллельность выполнения

### 🧠 Reasoning детали

Для каждого шага отображается:
- Текущая ситуация
- Шаги рассуждения
- Оставшиеся задачи
- Статус выполнения (достаточно данных, задача завершена)

## 🔧 Формат входных данных

Приложение работает с JSON файлами логов следующей структуры:

```json
{
  "id": "agent_id",
  "model_config": {
    "model": "model_name",
    "temperature": 0.2,
    "max_tokens": 8000
  },
  "task": "Описание задачи",
  "toolkit": ["tool1", "tool2"],
  "log": [
    {
      "step_number": 1,
      "timestamp": "2025-12-17T07:02:00.240803",
      "step_type": "llm_call",
      "phase": "reasoning_phase",
      "metrics": {
        "duration_ms": 2451.7,
        "total_tokens": 1891,
        "prompt_tokens": 1725,
        "completion_tokens": 166
      },
      "response": {...},
      "agent_reasoning": {...}
    }
  ]
}
```

## 🎨 Кастомизация

### Изменение цветовой схемы

В файле `visualizers.py` можно настроить цвета для разных типов шагов:

```python
STEP_COLORS = {
    'llm_call': '#3498db',      # Синий
    'reasoning': '#e74c3c',     # Красный
    'tool_execution': '#2ecc71', # Зеленый
    'final_answer': '#f39c12',   # Оранжевый
}
```

### Добавление новых визуализаций

1. Создайте новый метод в соответствующем классе визуализатора
2. Добавьте вызов в `app.py` в нужную секцию
3. Используйте `st.plotly_chart()` для отображения

## 🛠️ Разработка

### Архитектура

- **app.py** - главное приложение, управляет UI и взаимодействием
- **log_parser.py** - парсинг и структурирование данных логов
- **visualizers.py** - создание графиков и диаграмм с помощью Plotly

### Расширение функциональности

Для добавления новых типов визуализаций:

1. Добавьте новый класс в `visualizers.py`:
```python
class NewVisualizer:
    def create_chart(self, steps: List[AgentStep]) -> go.Figure:
        # Ваш код визуализации
        pass
```

2. Используйте в `app.py`:
```python
new_viz = NewVisualizer()
fig = new_viz.create_chart(parser.get_steps())
st.plotly_chart(fig)
```

## 📝 Примеры использования

### Анализ производительности

```python
from log_parser import LogParser

# Загрузка и парсинг
with open('logs/agent_log.json') as f:
    data = json.load(f)

parser = LogParser(data)

# Получение метрик
metrics = parser.get_aggregated_metrics()
print(f"Всего шагов: {metrics['total_steps']}")
print(f"Общее время: {metrics['total_duration_ms']} мс")
print(f"Всего токенов: {metrics['total_tokens']}")

# Анализ инструментов
tool_stats = parser.get_tool_usage_stats()
for tool, count in tool_stats.items():
    print(f"{tool}: {count} вызовов")
```

### Фильтрация шагов

```python
# Получить только reasoning шаги
reasoning_steps = parser.get_steps_by_type('reasoning')

# Получить шаги определенной фазы
action_steps = parser.get_steps_by_phase('action_selection')

# Анализ эволюции reasoning
evolution = parser.get_reasoning_evolution()
for item in evolution:
    print(f"Шаг {item['step_number']}: {item['current_situation']}")
```

## 🐛 Отладка

### Проблемы с запуском

Если приложение не запускается:

1. Проверьте версию Python (требуется Python 3.8+):
```bash
python --version
```

2. Переустановите зависимости:
```bash
pip install --upgrade -r requirements.txt
```

3. Очистите кэш Streamlit:
```bash
streamlit cache clear
```

### Проблемы с отображением

Если графики не отображаются:

1. Проверьте формат JSON логов
2. Убедитесь, что в логах есть данные в поле `log`
3. Проверьте консоль браузера на наличие ошибок

## 📦 Зависимости

- **streamlit** (>=1.31.0) - веб-фреймворк для интерактивных приложений
- **plotly** (>=5.18.0) - библиотека для интерактивных графиков
- **pandas** (>=2.1.0) - работа с данными
- **python-dateutil** (>=2.8.2) - парсинг дат

## 🤝 Вклад в проект

Для добавления новых функций:

1. Создайте issue с описанием функции
2. Форкните репозиторий
3. Создайте ветку для новой функции
4. Сделайте pull request

## 📄 Лицензия

Проект распространяется под лицензией проекта SGR Agent Core.

## 🔗 Ссылки

- [Streamlit Documentation](https://docs.streamlit.io/)
- [Plotly Documentation](https://plotly.com/python/)
- [SGR Agent Core](../README.md)

## ❓ FAQ

**Q: Можно ли визуализировать логи в реальном времени?**
A: Пока нет, но это запланировано в следующих версиях. Сейчас нужно загрузить готовый JSON файл.

**Q: Какой максимальный размер файла логов?**
A: Рекомендуется до 50MB. Для больших файлов может потребоваться увеличить лимит памяти Streamlit.

**Q: Можно ли экспортировать визуализации?**
A: Да, все графики Plotly можно экспортировать в PNG, SVG через контекстное меню графика.

**Q: Поддерживается ли сравнение нескольких запусков агента?**
A: В текущей версии нет, но это в планах развития.

## 📞 Поддержка

При возникновении проблем:
1. Проверьте FAQ выше
2. Создайте issue в репозитории
3. Приложите пример файла логов и скриншот ошибки

